// Создаем массив из объектов
//
//  text: формулировка вопроса
//  a1: ответ 1
//  a2: ответ 2
//  a3: ответ 3
//  a4: ответ 4
//  correctNum: номер правильного ответа
//  price: цена вопроса


var questions = [

    {
        text: '1*1 = ???\n',
        a1: 'Вариант 1 - 1\n',
        a2: 'Вариант 2 - 2\n',
        a3: 'Вариант 3 - 3\n',
        a4: 'Вариант 4 - 4\n',
        correctNum: 1,
        price: 1000
    },

    {
        text: '2*2 = ???\n',
        a1: 'Вариант 1 - 2\n',
        a2: 'Вариант 2 - 3\n',
        a3: 'Вариант 3 - 4\n',
        a4: 'Вариант 4 - 5\n',
        correctNum: 3,
        price: 2500
    },

    {
        text: '3*3 = ???\n',
        a1: 'Вариант 1 - 4\n',
        a2: 'Вариант 2 - 7\n',
        a3: 'Вариант 3 - 8\n',
        a4: 'Вариант 4 - 9\n',
        correctNum: 4,
        price: 5000
    },

    {
        text: '4*4 = ???\n',
        a1: 'Вариант 1 - 6\n',
        a2: 'Вариант 2 - 16\n',
        a3: 'Вариант 3 - 49\n',
        a4: 'Вариант 4 - 0\n',
        correctNum: 2,
        price: 10000
    },

    {
        text: '5*5 = ???\n',
        a1: 'Вариант 1 - 26\n',
        a2: 'Вариант 2 - 25\n',
        a3: 'Вариант 3 - 20\n',
        a4: 'Вариант 4 - 1905\n',
        correctNum: 2,
        price: 30000
    },

    {
        text: '6*6 = ???\n',
        a1: 'Вариант 1 - 90\n',
        a2: 'Вариант 2 - 23\n',
        a3: 'Вариант 3 - 36\n',
        a4: 'Вариант 4 - 98\n',
        correctNum: 3,
        price: 75000
    },

    {
        text: '7*7 = ???\n',
        a1: 'Вариант 1 - 56\n',
        a2: 'Вариант 2 - 42\n',
        a3: 'Вариант 3 - 49\n',
        a4: 'Вариант 4 - 29\n',
        correctNum: 3,
        price: 125000
    },

    {
        text: '8*8 = ???\n',
        a1: 'Вариант 1 - 64\n',
        a2: 'Вариант 2 - 6\n',
        a3: 'Вариант 3 - 4\n',
        a4: 'Вариант 4 - 164\n',
        correctNum: 1,
        price: 250000
    },

    {
        text: '9*9 = ???\n',
        a1: 'Вариант 1 - 88\n',
        a2: 'Вариант 2 - 89\n',
        a3: 'Вариант 3 - 84\n',
        a4: 'Вариант 4 - 81\n',
        correctNum: 4,
        price: 500000
    },

    {
        text: '10*10 = ???\n',
        a1: 'Вариант 1 - 101\n',
        a2: 'Вариант 2 - 010\n',
        a3: 'Вариант 3 - 100\n',
        a4: 'Вариант 4 - 111\n',
        correctNum: 3,
        price: 1000000
    }

    ];
